/* 
  Controls.strings
  Simple RSS Viewer

  Created by Gleb Gorelov on 24.09.14.
  Copyright (c) 2014 Gleb Gorelov. All rights reserved.
*/

/* Master View titles */

"MasterViewTitle_Loading" = "Загрузка...";
"MasterViewTitle_Refreshing" = "Обновление...";
"MasterViewTitle_Failed" = "Ошибка";


/* Default Feed title */
"MasterView_FeedNoTitle" = "[Без Заголовка]";

/* Detail view "More" button text */
"DetailView_ButtonMore" = "Еще";

/* Alert */

"AlertViewParsingIncomplete_Title" = "Загрузка не завершена";
"AlertViewParsingIncomplete_CancelButtonTitle" = "Понятно";
"AlertViewParsingIncomplete_Message" = "Случилось непоправимое при загрузке ленты. Не все элементы ленты могут быть загружены.";

/* FeedParser */
"Delegate or URL not specified" = "Делегат или URL не заданы";
"Asynchronous connection failed to URL: %@" = "Не возможно установить асинхронное соедение к URL: %@";
"Feed not a valid XML document" = "Лента не соответствует XML документу";
"Error with feed encoding" = "Ошибка считывания данных ленты";